# Taps
tap 'buo/cask-upgrade'
tap 'caskroom/cask'
#tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'

# Binaries
brew 'ack'
#brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'emacs'
brew 'git'
brew 'git-flow'
#brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
#brew 'imagick'
#brew 'mysql'
#brew 'nginx'
brew 'node'
#brew 'redis'

# Apps
#cask 'aerial' # https://github.com/JohnCoates/Aerial
cask 'alfred' # https://www.alfredapp.com
cask 'android-studio'
cask 'appcleaner'
cask 'caffeine' # http://lightheadsw.com/caffeine
cask 'carbon-copy-cloner'
cask 'dbeaver-community'
#cask 'discord'
cask 'docker'
cask 'dotnet-sdk'
#cask 'dropbox'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'insomnia'
cask 'java'
cask 'logitech-control-center'
cask 'meld'
#cask 'sequel-pro' # https://www.sequelpro.com
#cask 'skype'
cask 'sourcetree'
cask 'sublime-text'
#cask 'there' # http://there.pm
#cask 'transmit' # http://panic.com
cask 'vagrant'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'
cask 'zeplin'

# Quicklook
cask 'betterzip'
cask 'provisionql' # ipa files
cask 'qlcolorcode' # chmod +x ~/Library/Quicklook/QLColorCode.qlgenerator/Contents/Resources/colorize.sh
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen' # various README, etc.
cask 'qlswift'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'suspicious-package' # .pkg files

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-poppins'
cask 'font-roboto'
#cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Apple Configurator 2', id: 1037126344
#mas 'Giphy Capture', id: 668208984
#mas 'Keynote', id: 409183694
mas 'LanScan', id: 472226235
mas 'LastPass Password Manager', id: 926036361
#mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Trello', id: 1278508951
#mas 'Tweetbot', id: 1384080005
#mas 'WhatsApp', id: 1147396723 
